---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ViewShapeBuilder
source: html/6927503d-38b2-cce5-9624-990934d9237a.htm
---
# ViewShapeBuilder Members

Default constructor for an ViewShapeBuilder object.